<!DOCTYPE html>
<html>
<head>
	<meta charset="utf-8">
	<link href="https://fonts.googleapis.com/css2?family=Roboto@1&display=swap" rel="stylesheet">
	<link href="https://fonts.googleapis.com/css2?family=Style+Script&display=swap" rel="stylesheet">
<link rel="stylesheet" href="style.css" type="text/css">
<title>Piektdiena</title>
</head>

<body>
<div class="header">
	<div class="logo">
		<h1>Ilona Braima</h1>

	</div>
	<div class="menu">
		<div class="menu-item">
			<a class="menu-link" href="firstpage.php">Вернуться на главную</a>
		</div>
		<div class="menu-item">
			<a class="menu-link" href="date.php">Проект: Мои 100 свиданий</a>
		</div>
		<div class="menu-item">
			<a class="menu-link" href="children.php">Проект: ДЕТИ</a>
		</div>
		<div class="menu-item">
			<a class="icon" title="Facebook" href="https://www.facebook.com/ilonabraim/"><img src="images/fb.png"></a>
		</div>
		<div>
			<a class="icon" title="Instagram" href="https://www.instagram.com/ilona_braim/"><img src="images/ig.png"></a>
		</div>
	</div>
</div>

<div class=head-l>
	<div>
		<a class="linker" href="index.html">HOME</a>
	</div>
</div>

<div class="boxpage">

	<div class="borderbody"

		 <p>На этой страничке я расскажу вам, как скачет мой вес +-20 кг, как растёт моя нога 43 размера (раз в год
		 +1 размер), как я занимаюсь спортом, хожу по врачам - болею и лечусь. Расскажу обо всём, что касается моего тела.</p>
</div>
	<div class="boxfirstpage">

			<div class="row">
				<div class="left"></div>
				<div class="center">

								<h1>Один из главных проектов в моей жизни - МОЁ ТЕЛО</h1>

							<p>Я РАЗНАЯ: толстая, худая, вредная, любящая, но есть критерии, при соблюдении которых,
								я чувствую себя в себе, а вот когда выхожу за рамки, действительно я - не я.</p>
							<p>Сечас я вешу около 75 кг, но идеально себя чувствую при 72-73 кг.
								Война идёт всю жизнь, прыгая с 90 до 75 туда-сюда.</p>

							<div class="box">
						<div class="box-inner">
							<a href="#">
								<img src="images/2021.jpg" width="500">
							</a>
							<div class="text">
								<h2>37 лет. 75кг</h2>
							</div>
						</div>


					<div class="box">
						<div class="box-inner">
							<a href="#">
								<img src="images/2019-2020.jpg" width="500">
							</a>
							<div class="text">
								<h2>82-73кг</h2>
							</div>
						</div>
					</div>

					<div class="box">
						<div class="box-inner">
							<a href="#">
								<img src="images/2012.jpg" width="500">
							</a>
							<div class="text">
								<h2>2012 год. Мне 26 лет.</h2>
							</div>
						</div>
					</div>

					<div class="box">
						<div class="box-inner">
							<a href="#">
								<img src="images/2013.jpg" width="500">
							</a>
							<div class="text">
								<h2>2013 год. Мне 27 лет.</h2>
							</div>
						</div>
					</div>

					<div class="box">
						<div class="box-inner">
							<a href="#">
								<img src="images/2014.jpg" width="500">
							</a>
							<div class="text">
								<h2>2014 год. Мне 28 лет.</h2>
							</div>
						</div>
					</div>

					<div class="box">
						<div class="box-inner">
							<a href="#">
								<img src="images/2016.jpg" width="500">
							</a>
							<div class="text">
								<h2>2016 год. Мне 30 лет.</h2>
							</div>
						</div>
					</div>

					<div class="box">
						<div class="box-inner">
							<a href="#">
								<img src="images/j2017.jpg" width="500">
							</a>
							<div class="text">
								<h2>2017 год. Мне 31</h2>
							</div>
						</div>
					</div>

				</div>
				<div class="right"></div>
			</div>

		<p><img src="images/ja2.jpg" alt="Фото1" title="ja2" width="200">
		<img src="images/ja4.jpg" alt="Фото2" title="ja4" width="200">
		<img src="images/ja5.jpg" alt="Фото3" title="ja5" width="200">
		<img src="images/ja6.jpg" alt="Фото4" title="ja4" width="200"><
		<img src="images/ja1.jpg" alt="Фото5" title="ja5" width="200"></p>

		<div class="borderbody"
<p>Я вся такая несуразная, ну или в моменты позитивной волны, называю это эксклюзивностью💎) У меня всё ни как у людей🤷, том числе размер ноги👠. ⠀⠀
⠀
У меня всегда был большой размер ноги👣, до лет 25 был 40👟. А потом рождение каждого ребёнка добавил мне ➕1. Теперь у меня 4️⃣2️⃣.
⠀
С обувью👡 всегда были проблемы – высокий подъём, по причине роста нежелание носить каблуки👠, хотя в глубине души жаждала этого🙏.
⠀
Выбор большого размера обуви👢 всегда был очень примитивный – чёрные бесформенные и однажды в поисках сапог👢 я пошла в «Титаник», там мне так и сказали,
где я с такой растоптанной (ходила в основном в кроссовках) лаптёй, смогу найти красивые сапоги, типа бери, что есть. Я отказывалась брать, что есть и находила.
⠀
Конечно, выбор у меня всегда очень ограничен, но я борюсь.

Если с летней обувью👟 проще, в магазинах обуви @ccc_shoesbags достаточно большой выбор балеток и босоножек 42 и 43 размеров, даже можно найти туфли,
то с демисезонной и зимней обувью сложно.
⠀
Когда я сжилась с мыслью, что у меня всё же 42 размер (года 3-4 назад) и перестала мозолить ноги в 40 и 41, а поисках наткнулась на магазин @lielakurpe, тут может быть только одно разочарование, обувь большая. ⠀
Конечно, выбор зимней обуви👢 ни как у нормальных людей в обычном магазине🏪, но можно купить что-то не чёрное и я всё равно дождусь своих белых высоких сапог))) ⠀
Конечно, можно делать обувь на заказ, но я ж обычный человек – люблю просто увидеть и купить. А может просто боюсь цены🤑.
⠀
Однажды, когда ещё моя нога👣 активно росла, это во время беременностей и я не могла понять, почему не могу подобрать себе обувь, мама предложила приглядеться к мужской обуви👞 – меня так напугала эта мысль, но не допустила этой возможности. ⠀
Потом же мама мне очень помогла, почему-то в Латгалии легче купить обувь👡 большого размера, хотя качество хромает и приходилось частенько менять обувь.

Да-да, помните, во время беременности могут расти ноги👣, об этом я не только прочитала📚, но и проверила на себе))) ⠀
	А теперь у меня новенькие красные зимние сапоги👢, и есть подозрения, что именно из-за этого зима не уходит❄️❄️❄️)))</p>
А какой у вас размер ноги👣?

	</div>
</div>

</body>
</html>