<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <link rel="stylesheet" href="../styles/QA.css" type="text/css">
    <meta name="viewport" content="width=device-width, initial-scale=1.0 user-scalable=no, viewport-fit=cover" />
    <link href="https://fonts.googleapis.com/css2?family=Lobster&display=swap" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Roboto@1&display=swap" rel="stylesheet">
    <link href="https://fonts.googleapis.com/css2?family=Style+Script&display=swap" rel="stylesheet">
    <title>QA</title>
</head>

<body>
        <div class="header">
            <div class="menu">
                <div class="menu-item"><a class="menu-link" href="firstpage.php">ABOUT MI</a></div>
            </div>
        </div>
        <div class="boxpageqa">
            <div class="row first">
                <div class="left"><a class="logo" href="firstpage.php">Ilona Braima</a></div>
                    <div class="center">
                        <h1>Проект тестировщика ПО</h1>
                        <table>
                            <tr>
                                <th>Мой проект</th>
                                <th>Ссылка</th>
                                <th>Тип</th>
                            </tr>
                            <tr>
                                <td>PlayDay</td>
                                <td>https://playday.lv/</td>
                                <td>Web</td>
                            </tr>
                        </table>
                        <h1>О проекте</h1>
                        <img class="firstimg" src="../images/qaimages/playday/playday.png" alt="Фото1" title="playday">
                    </div>
                <div class="right">
                    <div class="borderbody"><a class="hiper" href="#mindcard">MindCard Playday</a>
                    <br/>
                    <a class="hiper" href="#sitechco">Чек-листы в Sitechco.ru</a>
                    <br/>
                     <a class="hiper" href="#mantis">Тестируем Mantis Bug Tracker</a>
                    <br/>
                    <a class="hiper" href="#bugzilla">Тестируем Bugzilla Bug Tracker</a>
                    <br/>
                     <a class="hiper" href="#jira">Добавляем баг в Jira</a>
                    <br/>
                    <a class="hiper" href="#redmine">Оформляем баги в Redmine</a>
                    <br/>
                    <a class="hiper" href="#transition">State Transition Playday.lv</a>
                    <br/>
                    <a class="hiper" href="#testlink">Тест кейсы в TestLink</a>
                    <br/>
                    <a class="hiper" href="#users">Users — добавить задание сотруднику</a>
                    <br/>
                    <a class="hiper" href="#stul">Тестируем стул!</a>
                    <br/>
                    <a class="hiper" href="#moneytour">Исследовательское тестирование: Денежный тур (Money Tour)</a>
                    <br/>
                    <a class="hiper" href="#poisk">Дана задача  по строке "Поиск"</a>
                    <br/>
                    <a class="hiper"href="#clasiktest">Классификация тестов по приложению</a>
                </div>
            </div>

            <div class="row">
                <div class="left"></div>
                    <div class="center">
                        <p>
                            Play Day - самый большой комплекс в Латвии, оборудованный под активные развлечения
                            для детей до 16 лет. Организация предлагает отдельные помещения для индивидуального
                            празднования день рождений, услуги аниматоров и др. Также предлагаются
                            индивидуальные и групповые занятия по танцам, спорту и др. Регулярно проходят
                            организованные Play Day праздники, фестивали и др мероприятия в помещениях и
                            на улице, куда приглашаются все желающие.
                        </p>
                    </div>
                <div class="right"></div>
            </div>

            <div class="row">
                <div class="left"></div>
                    <div class="center">
                        <h1 id="mindcard">MindCard PlayDay</h1>
                            <img src="playday/MindCard.png" alt="Фото1" title="playday" width="100%">
                    </div>
                <div class="right"></div>
            </div>

            <div class="row">
                <div class="left">
                </div>
                    <div class="center">
                        <h1 id="sitechco">
                            Чек-листы в Sitechco.ru
                        </h1>
                        <p>
                            Чек-листы на разный функционал. Тестируем особенность приложения.
                        </p>
                        <img src="../images/qaimages/playday/1.png" alt="Иллюстрация" width="100%">
                        <img src="../images/qaimages/playday/4.png" alt="Иллюстрация" width="100%">
                        <img src="../images/qaimages/playday/7.png" alt="Иллюстрация" width="100%">
                    </div>
                <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                    src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                </div>
            </div>

            <div class="row">
                <div class="left">
                </div>
                    <div class="center">
                            <h1 id="mantis">
                                Тестируем Mantis Bug Tracker
                            </h1>
                            <p>
                                Баги найденные на сайте Playday и оформлены в Mantis (Mantis Bug Tracker)
                            </p>
                        <img src="../images/qaimages/playday/9.png" alt="Иллюстрация" width="100%">
                        <img src="../images/qaimages/playday/8.png"alt="Иллюстрация" width="100%">
                        <img src="../images/qaimages/playday/10.png" alt="Иллюстрация" width="100%">
                        <img src="../images/qaimages/playday/11.png" alt="Иллюстрация" width="100%">
                        <img src="../images/qaimages/playday/12.png" alt="Иллюстрация" width="100%">
                    </div>
                <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                    src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                </div>
            </div>
            <div class="row">
                <div class="left">
                </div>
                    <div class="center">
                        <h1 id="bugzilla">
                            Тестируем Bugzilla Bug Tracker
                        </h1>
                        <p>
                            Баги найденны на сайте Playday и оформлены в Bugzilla
                        </p>
                        <img src="../images/qaimages/bug3.png" alt="Иллюстрация" width="100%">
                    </div>
                <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                    src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                </div>
            </div>

            <div class="row">
                <div class="left">
                </div>
                    <div class="center">
                        <h1 id="jira"> Добавляем баг в Jira</h1>
                        <img src="../images/qaimages/11.png" alt="Иллюстрация" width="100%">
                        <img src="../images/qaimages/10.png" alt="Иллюстрация" width="100%">
                    </div>
                <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                    src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                </div>
            </div>

            <div class="row">
                <div class="left">
                </div>
                    <div class="center">
                        <h1 id="redmine">Оформляем баги в Redmine</h1>
                        <img src="../images/qaimages/redmine1.png" alt="Иллюстрация" width="100%">
                        <img src="../images/qaimages/redmine2.png" alt="Иллюстрация" width="100%">
                        <p>Как должно быть:</p>
                        <img src="images/1.jpg" alt="Иллюстрация" width="100%">
                        <img src="images/redmine3.png" alt="Иллюстрация" width="100%">
                    </div>
                <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                    src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                </div>
            </div>

            <div class="row">
                <div class="left">
                </div>
                    <div class="center">
                        <h1 id="testlink">Тест кейсы в TestLink</h1>
                        <img src="../images/qaimages/playday/13.png" alt="Иллюстрация" width="100%">
                        <img src="../images/qaimages/playday/14.png" alt="Иллюстрация" width="100%">
                    </div>
                <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                    src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                </div>
            </div>

            <div class="row">
                <div class="left">
                </div>
                    <div class="center">
                        <h1 id="transition"> State Transition Playday.lv</h1>
                        <img src="../images/qaimages/9.png" alt="Иллюстрация" width="100%">
                    </div>
                <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                    src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                </div>
            </div>

            <div class="row">
                <div class="left">
                </div>
                <div class="center">
                    <h1 id="moneytour">Исследовательское тестирование: Денежный тур (Money Tour) Уиттакера на Playday.lv</h1>
                    <p>
                        Для своего проекта я выбрала Денежный тур, потому что это напрямую вяжется с целю создания сайта,
                        где можно посмотреть и выбрать себе место для любого детского праздника.
                    </p>
                    <p>
                        <b>Цель тура:</b> найти функции, которые заставляют людей тратить деньги на ваше ПО и проверить

                        их работу.
                    </p>
                    <p>
                        <b>Время тура:</b> 20 минут.
                    </p>
                    <p>
                        <b>В путь!</b>
                    </p>
                    <p>
                        Итак, нажав кнопку «О нас» мы перенесёмся в мини рассказ о том, что вас ждет в Playday.lv.
                    </p>
                    <img src="../images/qaimages/moneytour/1.png" alt="Иллюстрация" width="100%">
                    <p>
                        С первых строк понятно, что здесь можно просто прийти поиграть, побегать, попрыгать,
                        устроить частный детский праздник, посетить занятие в “Playschool” или записать ребёнка
                        в дневной лагерь на каникулах.
                    </p>
                    <img src="../images/qaimages/moneytour/2.png" alt="Иллюстрация" width="100%">
                    <p>
                        Листая дальше, мы сразу видим, какие услуги нам может предложить Playday.lv.
                        Но здесь они показаны частично (нет даже и трети из всего разнообразия), но об этом
                        мы узнаем только тогда, когда пройдём непосредственно по другим разделам.
                    </p>
                    <img src="../images/qaimages/moneytour/3.png" alt="Иллюстрация" width="100%">
                    <p>
                        Изучая далее, мы узнаём информацию, что Playday.lv устраивает массовые семейные мероприятия,
                        как на улице, так и у себя в помещениях.
                    </p>
                    <img src="../images/qaimages/moneytour/4.png" alt="Иллюстрация" width="100%">
                    <p>
                        Переходим по кнопке «Предстоящие мероприятия» понимаем, что ссылка битая. Во-первых,
                        сразу переключает тебя на латышский язык, а информация не отображается.
                    </p>
                    <img src="../images/qaimages/moneytour/5.png" alt="Иллюстрация" width="100%">
                    <p>
                        Идём смотреть, что же мы можем зарезервировать. В выплывающем списке можем видеть
                        пять игровых комнат. Названия комнат то написаны с маленькой буквы, то с большой.
                        Смотрится некрасиво.
                    </p>
                    <img src="../images/qaimages/moneytour/6.png" alt="Иллюстрация" width="100%">
                    <p>
                        В окне резервации опять появляется информация о центре.
                    </p>
                    <img src="../images/qaimages/moneytour/7.png" alt="Иллюстрация" width="100%">
                    <p>
                        Если хочется посмотреть больше фото, то нужно нажать на кнопку “Больше фотографий”.
                    </p>
                    <img src="../images/qaimages/moneytour/8.png" alt="Иллюстрация" width="100%">
                    <p>
                        После нажатия на кнопку появляется только ТРИ новые фотографии.
                    </p>
                    <img src="../images/qaimages/moneytour/9.png" alt="Иллюстрация" width="100%">
                    <p>
                        После повторного нажатия, криво появляется ещё три.
                    </p>
                    <img src="../images/qaimages/moneytour/10.png" alt="Иллюстрация" width="100%">
                    <p>
                        Нажимаем ещё раз и появляется последняя тройка и всё!
                    </p>
                    <img src="../images/qaimages/moneytour/11.png" alt="Иллюстрация" width="100%">
                    <p>
                        Пробегаем по комнатам. Комнаты отличаются вместимостью от 12 до 25 человек,
                        цветом стен и мебели, остальное в них стандарт – столы, стулья, вода, микроволновка,
                        чайник, пресс для кофе, графины.
                    </p>
                    <img src="../images/qaimages/moneytour/12.png" alt="Иллюстрация" width="100%">
                    <p>
                        В каждой комнате тоже можно посмотреть фото, но очень ограничено - 3-4 фотографии.
                    </p>
                    <img src="../images/qaimages/moneytour/13.png" alt="Иллюстрация" width="100%">
                    <p>
                        В резервации же можно почитать отзывы родителей.
                    </p>
                    <img src="../images/qaimages/moneytour/14.png" alt="Иллюстрация" width="100%">
                    <p>
                        Далее в меню “Услуги” кнопка не нажимается, но в выпадашке дублируются “Услуги”,
                        нажимая на которые и выходим на общую страницу услуг. Здесь, скорее всего, забыли
                        перевести на русский Services – услуги.
                    </p>
                    <img src="../images/qaimages/moneytour/15.png" alt="Иллюстрация" width="100%">
                    <p>
                        Дополнительные к праздникам услуги сразу идут с расценками.
                    </p>
                    <img src="../images/qaimages/moneytour/16.png" alt="Иллюстрация" width="100%">
                    <p>
                        Почему-то цену не поставили к Диско вечеринке, явно пропустили.
                    </p>
                    <img src="../images/qaimages/moneytour/17.png" alt="Иллюстрация" width="100%">
                    <p>
                        Но нажав на активное название, все цены и описание есть. Но описание зачем-то два раза.
                    </p>
                    <img src="../images/qaimages/moneytour/18.png" alt="Иллюстрация" width="100%">
                    <p>
                        Под описанием любой услуги, можно посмотреть небольшой перечень других услуг, перейти
                        в которые можно нажав или на активное фото или название.
                    </p>
                    <img src="../images/qaimages/moneytour/19.png" alt="Иллюстрация" width="100%">
                    <p>
                        То, что всё здесь покупается и продается свидетельствует Корзина (значок), который
                        не меняет своего месторасположения, как бы мы не крутили курсором вверх или вниз.
                    </p>
                    <img src="../images/qaimages/moneytour/20.png" alt="Иллюстрация" width="100%">
                    <p>
                        Помимо того, что корзина всегда с нами) В Разделе меню она же тоже есть.
                    </p>
                    <img src="../images/qaimages/moneytour/21.png" alt="Иллюстрация" width="100%">
                    <p>
                        Чтобы туда положить всё желаемое, нет необходимости регистрироваться заранее.
                        Заполняемся все поля только при оформлении заказа. Опять же оформление заказа,
                        как и все активные кнопки доступны на латышском языке.
                    </p>
                    <img class="litlleimg" src="../images/qaimages/moneytour/22.png" alt="Иллюстрация">
                    <p>
                        За последнюю минуту тура, ещё можно успеть пробежать по ценам. Цены вставлены
                        в виде картинки и сразу кидается в глаза, что картинка маленького разрешения.
                    </p>
                    <img class="mediumimg" src="../images/qaimages/moneytour/23.png" alt="Иллюстрация">
                    <p>
                        Выводы: подводя итоги тура можно сразу отметить, что тур помог по другому посмотреть на сайт.
                        За эти 20 минут нашлось много недочетов, недоделок сайта.
                        <br/>
                        1) Есть битые ссылки и даже целые страницы неотображаются.
                        <br/>
                        2) У некоторых услуг не проставлены цены.
                        <br/>
                        3) У основных продуктов на продажу мало визуальной информации, картинки с ценами плохого разрешения.
                        <br/>
                        4) При переключении функций, прыгают языки.
                        <br/>
                        5) Требуется поработать над тем, чтобы кнопки главного меню приобрели единый стиль и функциональность.
                    </p>
                </div>
                <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                    src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                </div>
            </div>

            <div class="row">
                <div class="left">
                </div>
                    <div class="center">
                        <h1 id="users">Users — добавить задание сотруднику</h1>
                        <h3>Задача</h3>

                        <b>
                            Выполнить тест-кейс «Добавить задание сотруднику».
                        </b>
                        <br/>
                        <b>
                            Совпадает ли фактический результат с ожидаемым?
                        </b>
                        <p>
                            <i>Комментарий</i>: На каждый шаг я написала <span class="gold">Ожидаемый результат</span> и
                        <span class="golden">Фактический результат.</span>
                        </p>
                        <p>
                            К общему результату я написала комментарии. Мне, как новичку, часто не хватало шагов и
                            пояснений к шагам, хотелось всего более подробного.
                        </p>

                        <h5>Шаги</h5>
                            <b>1. Перейти в раздел «Задачи» под менеджером — http://users.bugred.ru/tasks/index.html</b>

                        <p class="gold">Ожидаемый результат:</p>
                        <p>
                            Перейти в раздел «Задачи» под менеджером — http://users.bugred.ru/tasks/index.html
                        </p>
                        <p class="golden">Фактический результат:</p>

                        <ul>
                            <li>Зайти на сайт http://users.bugred.ru/tasks/index.html</li>
                            <li>Авторизоваться под менеджер manager@mail.ru / 1</li>
                            <li>Найти и нажать на раздел «Задачи»</li>
                        </ul>
                        <img src="../images/qaimages/1.png" alt="Иллюстрация" width="100%">
                        <b>2. Нажать кнопку «Добавить задачу»</b>
                        <p class="gold">Ожидаемый результат:</p>
                        <p>
                            После нажатия на кнопку «Добавить задачу», откроется страница с полем для
                             заполнения добавления задач.
                        </p>
                        <p class="golden">Фактический результат:</p>
                        <p>
                            Открылось поле для добавления задач.
                         </p>
                        <img src="../images/qaimages/2.png" alt="Иллюстрация" width="100%">
                        <b>3. Заполнить поля:</b>

                        <ul>
                            <li>Название задачи — «Тест»</li>
                            <li>Описание задачи — «Описание 1»</li>
                            <li>Ответственный — Петя</li>
                        </ul>

                            <p class="gold">Ожидаемый результат:</p>
                            <p>Все поля можно заполнить</p>
                            <p class="golden">Фактический результат:</p>
                            <p>Все поля заполнились соответствующим образом</p>
                        <img src="../images/qaimages/3.png" alt="Иллюстрация" width="100%">
                            <b>4. Нажать кнопку «Добавить задачу»</b>
                            <p class="gold">Ожидаемый результат:</p>
                            <p>Кнопка «Добавить задачу» сработала</p>
                            <p class="golden">Фактический результат:</p>
                            <p>Задача добавилась. Было 302 задачи, стало 303.</p>

                        <img src="../images/qaimages/4.png" alt="Иллюстрация" width="100%">

                            <b>5. Зайти в систему под Петей</b>
                        <p class="golden">Фактический результат:</p>
                        <p>Выйти из системы под логином Менеджер.
                        Войти под «Петей».</p>
                        <p class="gold">Ожидаемый результат:</p>
                        <p>Зашли в систему под Петей</p>
                        <u>Результат:</u>

                        <p>1)	На главной странице слева от нашего имени теперь написано «33 заданий»

                            <i>Комментарий: некорректно склоняется слово «заданий».</i>

                        <p>Было 32 задания</p>
                        <img src="../images/qaimages/5.png" alt="Иллюстрация" width="100%">
                        <p>Стало 33 задания</p>
                        <img src="../images/qaimages/6.png" alt="Иллюстрация" width="100%">
                        <p>
                            2) Если нажать на эту фразу, то попадаем в раздел заданий на вкладку «Текущие задачи».
                        В таблице одно задание (или сколько было исходно заданий + 1) — «Тест», с пустым расписанием.
                        И две кнопки:
                        </p>
                        <ul>
                        <li>сделал</li>
                        <li>продолбал</li>
                        </ul>
                        <p>
                            <i>Комментарий</i>: Трудно было понять, что за «фраза» - не кнопка, не опция, а почему-то фраза.
                        Всё остальное понятно и ок.
                        </p>
                        <img src="../images/qaimages/7.png"alt="Иллюстрация"width="100%">
                        <p>
                            3) Если нажать на число слева от фразы «1 задание» (количество уведомлений), то попадем на страницу
                        «Все непрочитанные уведомления», а там в таблице верхняя строка будет такой:
                        </p>
                        <ul>
                            <li>Дата — время создания задачи (когда мы выполнили пункт 4, то есть несколько минут назад)</li>
                            <li>Уведомление — «Для вас создали задачу»</li>
                            <li>Задача — «Тест»</li>
                        </ul>
                        <p>
                            <i>Комментарий</i>: Опять присутствует мной непонятная «фраза», а всё остальное
                            проверено и работает.
                        </p>
                        <img src="../images/qaimages/8.png" alt="Иллюстрация" width="100%">
                    </div>
                <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                    src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                </div>
            </div>

            <div class="row">
                <div class="left">
                </div>
                    <div class="center">

                        <h1 id="stul"> Тестируем стул!</h1>
                        <p>
                            "Вы прислали мне своё резюме и я дала тестовое задание — протестировать стул".
                        </p>
                        <p>
                            <b>Ваши действия? Как будете исследовать продукт, когда он попадет к вам в руки? Н
                                акидайте проверки.</b>
                        </p>
                        <h1>Тестируемый продукт – теннисный судейский стул (вышка)</h1>
                        <h4>Проверяем требования заказчика.</h4>
                        <h3>Стул должен устойчиво стоять</h3>
                        <p>
                            Для этого собрала стул и шатала его. Шатала с разных сторон. Стул устоял.
                        </p>
                        <p>
                            Поставила стул на прямую твёрдую поверхность, нагрузила мешками с песком весом с крупного
                            мужчину(90-100 кг) и повторила действия с шатанием стула.
                        </p>
                        <p>
                            Затем нагрузила мешками превышающими вес среднего мужчины в два раза, трясла и шатала.
                            Стул устоял.
                        </p>
                        <p>
                            Привязала верёвки со всех сторон за ножки и дёргала за них. Стул устоял.
                        </p>
                        <i>
                            Проверено: Стул устойчиво стоит.
                        </i>
                        <h3>Судье там должно быть удобно сидеть на протяжении всего матча</h3>
                        <p>
                            Взяла сидение отдельно от металлической конструкции и испытывала на удобство и прочность.
                            В течение недели в минуты отдыха сидела именно на нём.
                        </p>
                        <p>
                            Проверила пластиковое сидение на ударостойкость. Закидывала его теннисными мячами и
                            била рукоятками от ракеток. Сидение не пострадало.
                        </p>
                        <p>
                            Проверила и то, что сзади сидение удерживается дополнительной перекладиной. Перекладина литая,
                            прочная, от механических дёрганий и даже стояний на ней не прогнулась.
                        </p>
                        <i>
                            Проверено: Сидение прочное, ударостойкое. Сидение удобное.
                        </i>
                        <h3>Судья должен видеть со стула всю площадку</h3>
                        <p>
                            Залезла на стул и посмотрели вокруг, с вышки просматривается весь корт.
                        </p>
                        <i>
                            Проверено: С вышки можно увидеть весь теннисный корт.
                        </i>
                        <h3>Использоваться стул будет как в зале, так и на улице, для игры на травяных кортах</h3>
                        <p>
                            Проверила, не скользят ли ножки стула на разных поверхностях. Поставила стул на траву,
                            тянула его и толкали. Полила траву водой и повторила действия.
                        </p>
                        <i>
                            Проверено: Стул устоял, не скользил и не шатался.
                        </i>
                        <h3>Проверила стул на случай дождя</h3>
                        <p>
                            Присутствует антискользящее покрытие ступенек, ступеньки не скользили не в сухом состоянии, ни
                            после того, как их полила водой.
                        </p>
                        <p>Также после поливания стула водой проверила, чтобы на вышке не оставалась вода. Вода сразу
                            стекает по специальным лобкам.
                        </p>
                        <p>
                            Проверила специальный зонтик от дождя. Воду не пропускает, не гнётся от ветра, не выгибается.
                        </p>
                        <h1>Итог</h1>
                        <p>
                            Стул прошёл тестирование, можно закупать партию.
                        </p>
                    </div>
                <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                    src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                </div>
            </div>

            <div class="row">
                <div class="left">
                </div>
                    <div class="center">
                        <h1 id="poisk">
                            Дана задача  по строке "Поиск"
                        </h1>
                        <h3>
                            Есть система, в ней 100 строковых полей. Поиск должен работать только по 10 из них по ТЗ. Поиск
                            регистронезависимый, работает только по полному совпадению
                        </h3>
                        <h5>Что делать</h5>
                        <p>
                            Проверить поиск — расскажите, как вы будете это делать? С каких тестов начнете? Сколько тестов надо
                            провести?
                        </p>
                        <p>
                            <i>Ответ:</i>
                        <p>
                            <b>Kак вы будете это делать?</b>
                        </p>
                        <p>
                            Чтобы проверить поиск, сначала пройдёмся по конкретному заданию, ещё раз актуализируем,
                             что необходимо тестировать и в какой мере. Зададим вопросы.
                        </p>
                        <p>
                            По пунктам создадим  план тестирования. На каждый пункт будем создавать тест кейсы,
                            в котором распишем шаги, нацеленные на получение результата.
                        </p>
                        <p>
                            Вначале нам нужно проверить, что первые 10 полей сайта имеют поиск, а у остальных полей с
                            11-100 поиск не работает. Впишем во все поля одинаковое слово - СЛОВО. В поиск забьём
                             это слово и проверим, в скольких полях отразится СЛОВО.
                        <p>
                            <span class="gold">Фактический результат:</span>СЛОВО отразилось в 10 первых полях.
                        </p>
                        <p>
                            Создадим тест кейс, для проверки регистронезависимости поиска.
                        </p>
                        <p>
                            Применяем позитивное тестирование, где вводим слово с написанием только прописными буквами,
                            а также негативное, где слово СлОвО, чередуя заглавную и прописную, забиваем в поиск и смотрим
                            на результат.
                        </p>
                        <p><span class="gold">Фактический результат:</span> поиск находит слово СЛОВО независимо от того,
                        в каком регистре оно вписано.
                        </p>
                        <p>
                            Составим тест-кейс для того чтобы проверить, что поиск работает по полному совпадению.
                        </p>
                        <p>
                            Для проверки необходимо взять одно слово из любой строки и проверить его на совпадения,
                            сначала записав его целым, потом изменяя, убирая или добавляя в него символы и буквы. В итоге,
                            должны придти к фактическому результату, где поиск работает только по полному совпадению.
                        </p>
                            <b>С каких тестов начнете?</b>
                        <p>
                            В первую очередь начнём с позитивного и негативного тестирования.
                        </p>
                        <b>Сколько тестов надо провести?</b>
                        <p>
                            Столько тестов, сколько необходимо, чтобы проверить, что поиск работает по ТЗ.
                        </p>
                    </div>
                <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                    src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                </div>
            </div>
        <div class="row">
            <div class="left">
            </div>
            <div class="center">
                <h1 id="clasiktest">
                    Классификация тестов по приложению
                </h1>
                <h2>Виды тестирования</h2>
                <br/>
                <b>Функциональные тесты (Functional testing)</b>
                <ul>
                    <li>Забронировать комнату</li>
                    <li>Проверить Поиск в разделе Новости</li>
                </ul>
                <br/>
                <b>Тесты производительности (Performance testing)</b>
                <ul>
                    <li>Определить количество пользователей, одновременно работающих с приложением</li>
                </ul>
                <br/>
                <ul>Нагрузочные тесты (Load testing)
                    <li>Сымитировать вход на сайт одновременно 5000 пользователей</li>
                </ul>
                <br/>
                <b>Тестирование надежности (Reliability testing)</b>
                <ul>
                    Проверить, что сайт может работать под нагрузкой (посещение сайта меняется от 0 до 50 000
                    посетителей) 5 дней подряд.
                </ul>
                <br/>
                <b>Тестирование совместимости (Compatibility testing)</b>
                <ul>
                    <li>Проверить работу сайта на разных браузерах Google Chrome, Edge, Safari, Opera, Mozilla Firefox</li>
                    <li>Проверить работу сайта на разных устройствах мобильное устройство (Android, IOS), Ноутбук,
                        стационарный компьютер, планшет</li>
                </ul>
                <br/>
                <h2>Типы тестирования</h2>
                <br/>
                <b>Позитивные</b>
                <br/>
                <i>Функциональные</i>
                <ul>
                    <li>Оформить бронирование на Комнату «Персик»</li>
                </ul>
                <i>Нефункциональные</i>
                <ul>
                    <li>Проверить языковые аспекты</li>
                </ul>
                <br/>
                <b>Негативные</b>
                <br/>
                <i>Функциональные</i>
                <ul>
                    <li>Ввод 78ОАСЧКОМ8.Б» в строку для ввода купонов на скидку</li>
                </ul>
                <i>Нефункциональные</i>
                <ul>
                    <li>Одновременный выбор одной даты и одного времени для бронирования одной и той же комнаты
                        100 пользователями</li>
                </ul>
                <br/>
                <h2>Форматы тестирования</h2>
                <br/>
                <b>Скриптовое тестирование (по тестам):</b> для каких (конкретно) частей продукта и в каких случаях будет полезнее всего?
                <ul>
                    <li>Тестирование бронирования заказа</li>
                    <li>Тестирование оформления заказа</li>
                </ul>
                <br/>
                <b>Исследовательское тестирование (свободным поиском):</b>
                для каких частей продукта и в каких случаях будет полезнее всего?
                <ul>
                    <li>Тестирование интерфейса</li>
                </ul>
                <br/>
                <b>Автоматизированное тестирование:</b> для проверки какого функционала наиболее полезно?
                Почему именно для него?
                <ul>
                    <li>Нагрузка на выбор дат и времени для бронирования комнат ( от скорости реакции сайта и
                    надёжности этой системы зависит прибыль предприятия, поэтому необходимо автоматизировать процесс
                    на регулярную проверку)
                </ul>
            </div>
                        <div class="right"><a class="iconhome" title="HOME" href="../index.html"><img
                                            src="../images/qaimages/playday/bug.jpg" alt="Home"></a>
                        </div>
    </div>


</body>
</html>